�>>�#include "pch.h"
#include "Utils.h"
#include "MenuItem.h"
#include "Menu.h"
#include "App.h"
#include "Palette.h"


int main()
{
    // нас�'ройка в�<вода в консо�>>ь
    init(L"Задание на 04.02.2026 - прак�'ика испо�>>ьзования STL в разра�+/-о�'ке при�>>ожений");
    ostringstream oss;

    // код�< команд
    enum Commands : int {
        // Покааза�'ь �'екущие сведения о магазине
        CMD_SHOW_ALL = 1001,

        // � ормирование ко�>>�>>ек�-ии фа�+/-ричн�<м ме�'одом
        CMD_CREATE_FACTORY,

        // До�+/-ав�>>ение игр�<, сформированной фа�+/-ричн�<м ме�'одом
        CMD_ADD,

        // Редак�'ирование игр�< (фа�+/-ричн�<м ме�'одом, ид вводи�'ся с к�>>авиа�'ур�<)
        CMD_EDIT_BY_ID,

        // Уда�>>ение игр�< по иден�'ифика�'ору
        CMD_DELETE_BY_ID,

        // Упорядочивание игр по иден�'ифика�'ору
        CMD_ORDER_BY_ID,

        // Упорядочи�'е в�<вод игр по у�+/-�<ванию года издания
        CMD_ORDER_BY_YEAR_DESC,

        // Упорядочи�'е в�<вод игр по возрас�'анию �-ен�<
        CMD_ORDER_BY_PRICE_ASC,

        // Упорядочи�'е в�<вод игр по у�+/-�<ванию ко�>>ичес�'ва проданн�<х копий
        CMD_ORDER_BY_SOLD_DESC,

        // �'�<�+/-орка игр по диапазону �-ен�<, сор�'ировка по возрас�'анию �-ен�<
        CMD_SELECT_BY_PRICE_RANGE,

        // �'�<�+/-орка игр по году издания, сор�'ировка по жанру
        CMD_SELECT_BY_YEAR,

        // �'�<�+/-орка игр по ОС, сор�'ировка по у�+/-�<ванию года издания
        CMD_SELECT_BY_OS,

        // Запись сведений о магазине и ко�>>�>>ек�-ии игр в CSV-фай�>>
        CMD_SAVE_CSV,

        // Ч�'ение сведений о магазине и ко�>>�>>ек�-ии игр из CSV-фай�>>а
        CMD_LOAD_CSV,
    };

    // век�'ор пунк�'ов меню
    vector<MenuItem> items = {
        {CMD_SHOW_ALL,              "Покааза�'ь �'екущие сведения о магазине"},
        {CMD_CREATE_FACTORY,        "� ормирование ко�>>�>>ек�-ии (фа�+/-ричн�<й ме�'од)"},
        {CMD_ADD,                   "До�+/-ав�>>ение игр�< (фа�+/-ричн�<й ме�'од)"},
        {CMD_EDIT_BY_ID,            "Редак�'ирование игр�< по иден�'ифика�'ору (фа�+/-ричн�<й ме�'од)"},
        {CMD_DELETE_BY_ID,          "Уда�>>ение игр�< по иден�'ифика�'ору"},
        {CMD_ORDER_BY_ID,           "Упорядочивание игр по иден�'ифика�'ору"},
        {CMD_ORDER_BY_YEAR_DESC,    "Упорядочи�'ь в�<вод игр по у�+/-�<ванию года издания"},
        {CMD_ORDER_BY_PRICE_ASC,    "Упорядочи�'ь в�<вод игр по возрас�'анию �-ен�<"},
        {CMD_ORDER_BY_SOLD_DESC,    "Упорядочи�'ь в�<вод игр по у�+/-�<ванию проданн�<х копий"},
        {CMD_SELECT_BY_PRICE_RANGE, "�'�<�+/-орка по диапазону �-ен (сор�'ировка по возрас�'анию �-ен�<)"},
        {CMD_SELECT_BY_YEAR,        "�'�<�+/-орка по году издания (сор�'ировка по жанру)"},
        {CMD_SELECT_BY_OS,          "�'�<�+/-орка по ОС (сор�'ировка по у�+/-�<ванию года издания)"},
        {CMD_SAVE_CSV,              "Запись сведений о магазине в фай�>> CSV"},
        {CMD_LOAD_CSV,              "Ч�'ение сведений о магазине из фай�>>а CSV"},
        {Menu::CMD_QUIT,            "�'�<ход из при�>>ожения"}
    };

    Menu mainMenu(COORD{ 5, 5 }, items, infoColor, hintColor);

    // О�+/-ъек�' к�>>асса при�>>ожения д�>>я о�+/-ра�+/-о�'ок по заданию
    App* app = nullptr;

    while (true) {
        try {
            // Создание о�+/-ъек�'а при�>>ожения в защищенной о�+/-�>>ас�'и
            if (app == nullptr) {
                app = new App();
            } // if

            cout << color(mainColor) << cls;
            showNavBarMessage(
                hintColor, acctColor,
                "  Магазин компью�'ерн�<х игр (STL, а�>>гори�'м�<)  |  ~Esc~ ~F10~ �'�<ход"
            );
            int cmd = mainMenu.navigate();
            cout << color(mainColor) << cls;
            if (cmd == Menu::CMD_QUIT) break;

            switch (cmd) {
                // Покааза�'ь �'екущие сведения о магазине
            case CMD_SHOW_ALL:
                app->doShowAll();
                break;

                // � ормирование ко�>>�>>ек�-ии фа�+/-ричн�<м ме�'одом
            case CMD_CREATE_FACTORY:
                app->doCreateFactoryCollection();
                break;

                // До�+/-ав�>>ение игр�<, сформированной фа�+/-ричн�<м ме�'одом
            case CMD_ADD:
                app->doAddGame();
                break;

                // Редак�'ирование игр�< (фа�+/-ричн�<м ме�'одом, ид вводи�'ся с к�>>авиа�'ур�<)
            case CMD_EDIT_BY_ID:
                app->doEditGameById();
                break;

                // Уда�>>ение игр�< по иден�'ифика�'ору
            case CMD_DELETE_BY_ID:
                app->doDeleteGameById();
                break;

                // Упорядочивание игр по иден�'ифика�'ору
            case CMD_ORDER_BY_ID:
                app->doOrderById();
                break;

                // Упорядочи�'е в�<вод игр по у�+/-�<ванию года издания
            case CMD_ORDER_BY_YEAR_DESC:
                app->doOrderByYearDescending();
                break;

                // Упорядочи�'е в�<вод игр по возрас�'анию �-ен�<
            case CMD_ORDER_BY_PRICE_ASC:
                app->doOrderByPriceAscending();
                break;

                // Упорядочи�'е в�<вод игр по у�+/-�<ванию ко�>>ичес�'ва проданн�<х копий
            case CMD_ORDER_BY_SOLD_DESC:
                app->doOrderBySoldCopiesDescending();
                break;

                // �'�<�+/-орка игр по диапазону �-ен�<, сор�'ировка по возрас�'анию �-ен�<
            case CMD_SELECT_BY_PRICE_RANGE:
                app->doFindByPriceRange();
                break;

                // �'�<�+/-орка игр по году издания, сор�'ировка по жанру
            case CMD_SELECT_BY_YEAR:
                app->doFindByPubYear();
                break;

                // �'�<�+/-орка игр по ОС, сор�'ировка по у�+/-�<ванию года издания
            case CMD_SELECT_BY_OS:
                app->doFindByOS();
                break;

                // Запись сведений о магазине и ко�>>�>>ек�-ии игр в CSV-фай�>>
            case CMD_SAVE_CSV:
                app->doSaveToCsv();
                break;

                // Ч�'ение сведений о магазине и ко�>>�>>ек�-ии игр из CSV-фай�>>а
            case CMD_LOAD_CSV:
                app->doLoadFromCsv();
                break;
            } // switch
        }
        catch (exception& ex) {
            // за�>>ивка экрана �+/-азов�<м �-ве�'ом, в�<вод с�'роки навига�-ии с соо�+/-щением
            cout << color(mainColor) << cls;
            showNavBarMessage(hintColor, "  Оши�+/-ка в при�>>ожении, нажми�'е �>>ю�+/-ую к�>>авишу д�>>я продо�>>жения");

            int width = 72;

            oss.str("");
            oss << endlm(4) << left
                << "\t" << setw(width) << " " << "\n"
                << "\t" << setw(width) << "    [Оши�+/-ка]" << "\n"
                << "\t    " << left << setw(width - 4) << ex.what() << right << "\n"
                << "\t" << setw(width) << " " << "\n"
                << "\t" << setw(width) << " " << "\n"
                << endlm(4)
                << right;
            showMessage(oss.str(), errColor, mainColor);
        } // try-catch

        getKey("    Нажми�'е �>>ю�+/-ую к�>>авишу д�>>я продо�>>жения...");
    } // while

    delete app;
    cls();
    return 0;
} // main
